{
  "_num_labels": 11,
  "architectures": [
    "BertCrfForNer"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bad_words_ids": null,
  "bos_token_id": null,
  "decoder_start_token_id": null,
  "do_sample": false,
  "early_stopping": false,
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-FUNC",
    "10": "I-QUALIFICATION",
    "2": "I-FUNC",
    "3": "B-POWER",
    "4": "I-POWER",
    "5": "B-SAP",
    "6": "I-SAP",
    "7": "B-TECH",
    "8": "I-TECH",
    "9": "B-QUALIFICATION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "is_encoder_decoder": false,
  "label2id": {
    "B-FUNC": 1,
    "B-POWER": 3,
    "B-QUALIFICATION": 9,
    "B-SAP": 5,
    "B-TECH": 7,
    "I-FUNC": 2,
    "I-POWER": 4,
    "I-QUALIFICATION": 10,
    "I-SAP": 6,
    "I-TECH": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.0,
  "loss_type": "ce",
  "max_length": 20,
  "max_position_embeddings": 512,
  "min_length": 0,
  "model_type": "bert",
  "no_repeat_ngram_size": 0,
  "num_attention_heads": 12,
  "num_beams": 1,
  "num_hidden_layers": 12,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_past": true,
  "pad_token_id": 0,
  "prefix": null,
  "pruned_heads": {},
  "repetition_penalty": 1.0,
  "task_specific_params": null,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "vocab_size": 30522
}
